
var dataGPTru={'В': 0.03981974297155932, 'КОТОРАЯ': 0.0017609410755148741, 'ДО': 0.00032690421706440013, 'ВРЕМЕНИ': 0.0013127247466492317, 'ПРИВЕЛО': 0.0009436805328538738, 'И': 0.060681595292579105, 'КОТОРЫЕ': 0.0033635379208891794, 'ОНИ': 0.006753892203334427, 'ОБРАЗОМ,': 0.001064992644655116, 'ОДНИМ': 0.0013127247466492317, 'ЯВЛЯЕТСЯ': 0.003447817914351095, 'МОЖЕТ': 0.006484451618175872, 'ОДНАКО,': 0.0011071326413860738, 'ЕСЛИ': 0.0004903563255966002, 'ПО': 0.0011863047564563583, 'КОТОРЫЙ': 0.003400570039228506, 'ТАКЖЕ': 0.0061626552795031025, 'БЫ': 0.00036904421379535795, 'НЕСМОТРЯ': 0.0011071326413860738, 'СВОЙ': 0.000901540536122916, 'ЖЕ': 0.00032690421706440013, 'У': 0.0006959484308597581, 'ИХ': 0.00619968739784243, 'МИР': 0.0017609410755148741, 'СЕБЯ': 0.0024619973847662636, 'СТАЛА': 0.0013918968617195162, 'ПОД': 0.00016345210853220007, 'МНОЖЕСТВО': 0.0007380884275907159, 'НИХ': 0.00036904421379535795, 'ОТ': 0.00217212528604119, 'СУЩЕСТВУЕТ': 0.0009436805328538738, 'ЖИЗНЬ': 0.001064992644655116, 'НИ': 0.00016345210853220007, 'ВРЕМЯ': 0.000532496322327558, 'НАСЛАЖДАТЬСЯ': 0.0008594005393919581, 'ГОЛОС,': 0.000532496322327558, 'НЕГО': 0.00016345210853220007, 'МНЕ': 0.00016345210853220007, 'ТО': 0.00016345210853220007, 'ДОСТИЧЬ': 0.0007380884275907159, 'УМЕТЬ': 0.0009436805328538738, 'ПРИВЕЛОК': 0.0009436805328538738, 'ТАКИМОБРАЗОМ,': 0.001064992644655116, 'ОДНИМИЗ': 0.0011492726381170317, 'ВСЕЕЩЕ': 0.000532496322327558, 'СВЯЗАННЫЕС': 0.0005746363190585158, 'МОЖЕТПОТРЕБОВАТЬСЯ': 0.00036904421379535795, 'МОЖНОКУПИТЬ': 0.00036904421379535795, 'НЕСМОТРЯНА': 0.0011071326413860738, 'ИЕЕ': 0.0006959484308597581, 'ОНИТАКЖЕ': 0.0009436805328538738, 'ИСЛЕДИТЬ': 0.00036904421379535795, 'ИИХ': 0.0007380884275907159, 'ВЛИЯЮТНА': 0.00036904421379535795, 'ЭТОМОЖЕТ': 0.0011914126348479895, 'МОЖЕТПРИВЕСТИ': 0.0007802284243216737, 'ПРИВЕСТИК': 0.0009858205295848316, 'СУЩЕСТВУЕТМНОЖЕСТВО': 0.0005746363190585158, 'НЕОТЪЕМЛЕМОЙЧАСТЬЮ': 0.00036904421379535795, 'ТОМ,КАК': 0.0006959484308597581, 'УВИДЕТЬМИР': 0.00036904421379535795, 'МИРВ': 0.00036904421379535795, 'ГДЕМОЖНО': 0.0005746363190585158, 'МОЖНОНАСЛАЖДАТЬСЯ': 0.00036904421379535795, 'ИЗНАИБОЛЕЕ': 0.00036904421379535795, 'АКТИВНОЕУЧАСТИЕ': 0.00036904421379535795, 'МЫЖИВЕМ': 0.00036904421379535795, 'ЖИВЕМВ': 0.00036904421379535795, 'ЧТОБЫДОБИТЬСЯ': 0.00036904421379535795, 'ДОБИТЬСЯУСПЕХА': 0.00036904421379535795, 'СЛЮДЬМИ': 0.00036904421379535795, 'ПОМОГАЕТНАМ': 0.0005746363190585158, 'ИНЕ': 0.00016345210853220007, 'ЭТОПРИВЕЛОК': 0.00036904421379535795, 'ЧТОПРИВЕЛОК': 0.00036904421379535795, 'ОДНИМИЗСАМЫХ': 0.0005746363190585158, 'СТЕМ,ЧТО': 0.00036904421379535795, 'МОЖЕТБЫТЬНЕ': 0.00036904421379535795, 'НООНИТАКЖЕ': 0.00036904421379535795, 'ИСЛЕДИТЬЗА': 0.00036904421379535795, 'ЭТОМОЖЕТПРИВЕСТИ': 0.00036904421379535795, 'МОЖЕТПРИВЕСТИК': 0.0007802284243216737, 'ОТОМ,КАК': 0.0006959484308597581, 'УВИДЕТЬМИРВ': 0.00036904421379535795, 'МИРВИНОМ': 0.00036904421379535795, 'ГДЕМОЖНОНАСЛАЖДАТЬСЯ': 0.00036904421379535795, 'АКТИВНОЕУЧАСТИЕВ': 0.00036904421379535795, 'МЫЖИВЕМВ': 0.00036904421379535795, 'ЧТОБЫДОБИТЬСЯУСПЕХА': 0.00036904421379535795, 'ТОГДА': 0, 'ПОЧТИ': 0, 'ДА': 0, 'МОЕЙ': 0, 'ТАМ': 0, 'ВСЕЙ': 0, 'СЕЙЧАС': 0, 'ПОТОМУ': 0, 'ТАКОГО': 0, '—': 0, 'УМЕНЯ': 0}
var dataHumru={'В': 0.029323019148004306, 'И': 0.03867383042121491, 'ТОГДА': 0.0004941125332408198, 'У': 0.004103479997894634, 'ТО': 0.0016262339506827755, 'НИ': 0.0008574452893411683, 'ПО': 0.006709868920210589, 'ПОЧТИ': 0.00044391928925146076, 'МНЕ': 0.0022449432564476614, 'ДА': 0.0003580360889332751, 'МОЕЙ': 0.0009051152938448307, 'ДО': 0.0018958635998121683, 'ТАМ': 0.0008747220046830776, 'ВРЕМЯ': 0.0012946811975848677, 'БЫ': 0.0011560815137916258, 'ТАКЖЕ': 0.0012603779550967292, 'ОТ': 0.004114323520424465, 'КОТОРЫЕ': 0.0011045015559615783, 'ПОД': 0.001120391557462799, 'ОНИ': 0.0019513535109686008, 'ВСЕЙ': 0.0003580360889332751, 'СЕЙЧАС': 0.0008892252923436098, 'ИХ': 0.0017609236811496323, 'НЕГО': 0.0008627419565082418, 'ЖЕ': 0.0024546726647028797, 'СЕБЯ': 0.0005139124880684258, 'СТАЛА': 0.00017706306780344491, 'СВОЙ': 0.0002933395572833837, 'МОЖЕТ': 0.0012021146162589206, 'КОТОРЫЙ': 0.0006262790242219791, 'КОТОРАЯ': 0.0002523529337874835, 'ПОТОМУ': 0.0006619689805508058, 'НИХ': 0.0010490116448051458, 'ТАКОГО': 0.0003831327109279546, 'ЕСЛИ': 0.0015470341313723514, 'ЯВЛЯЕТСЯ': 0.00038704266425433983, 'МИР': 0.00021136631029158325, 'ОДНАКО,': 2.5096621994679515e-05, 'ДОСТИЧЬ': 2.5096621994679515e-05, 'ОДНИМ': 0.00019156635546397732, '—': 0.002587725493133367, 'ОБРАЗОМ,': 0.00023646293228626276, 'ВРЕМЕНИ': 0.00010038648797871806, 'ЖИЗНЬ': 0.00022725631179280396, 'НЕСМОТРЯ': 0.00011097982231286519, 'МНОЖЕСТВО': 5.5489911156432595e-05, 'ИНЕ': 0.0010292116899775397, 'УМЕНЯ': 0.0006460789790495851, 'ИЕЕ': 2.5096621994679515e-05, 'ТАКИМОБРАЗОМ,': 0.00023646293228626276, 'ОДНИМИЗ': 0.00010568315514579164, 'НЕСМОТРЯНА': 0.00011097982231286519, 'ТОМ,КАК': 2.5096621994679515e-05, 'ОТОМ,КАК': 2.5096621994679515e-05, 'ПРИВЕЛО': 3.0393289161753083e-05, 'СУЩЕСТВУЕТ': 3.0393289161753083e-05, 'ГОЛОС,': 3.0393289161753083e-05, 'ПРИВЕЛОК': 3.0393289161753083e-05, 'ИИХ': 3.0393289161753083e-05, 'НАСЛАЖДАТЬСЯ': 0.0, 'УМЕТЬ': 0.0, 'ВСЕЕЩЕ': 0.0, 'СВЯЗАННЫЕС': 0.0, 'МОЖЕТПОТРЕБОВАТЬСЯ': 0.0, 'МОЖНОКУПИТЬ': 0.0, 'ОНИТАКЖЕ': 0.0, 'ИСЛЕДИТЬ': 0.0, 'ВЛИЯЮТНА': 0.0, 'ЭТОМОЖЕТ': 0.0, 'МОЖЕТПРИВЕСТИ': 0.0, 'ПРИВЕСТИК': 0.0, 'СУЩЕСТВУЕТМНОЖЕСТВО': 0.0, 'НЕОТЪЕМЛЕМОЙЧАСТЬЮ': 0.0, 'УВИДЕТЬМИР': 0.0, 'МИРВ': 0.0, 'ГДЕМОЖНО': 0.0, 'МОЖНОНАСЛАЖДАТЬСЯ': 0.0, 'ИЗНАИБОЛЕЕ': 0.0, 'АКТИВНОЕУЧАСТИЕ': 0.0, 'МЫЖИВЕМ': 0.0, 'ЖИВЕМВ': 0.0, 'ЧТОБЫДОБИТЬСЯ': 0.0, 'ДОБИТЬСЯУСПЕХА': 0.0, 'СЛЮДЬМИ': 0.0, 'ПОМОГАЕТНАМ': 0.0, 'ЭТОПРИВЕЛОК': 0.0, 'ЧТОПРИВЕЛОК': 0.0, 'ОДНИМИЗСАМЫХ': 0.0, 'СТЕМ,ЧТО': 0.0, 'МОЖЕТБЫТЬНЕ': 0.0, 'НООНИТАКЖЕ': 0.0, 'ИСЛЕДИТЬЗА': 0.0, 'ЭТОМОЖЕТПРИВЕСТИ': 0.0, 'МОЖЕТПРИВЕСТИК': 0.0, 'УВИДЕТЬМИРВ': 0.0, 'МИРВИНОМ': 0.0, 'ГДЕМОЖНОНАСЛАЖДАТЬСЯ': 0.0, 'АКТИВНОЕУЧАСТИЕВ': 0.0, 'МЫЖИВЕМВ': 0.0, 'ЧТОБЫДОБИТЬСЯУСПЕХА': 0.0}
var data={}
var forceru={'И': 0.014515643317651514, 'В': 0.0039824786690606, 'ПО': 0.0033270070117586373, 'У': 0.00290962836151119, 'МОЖЕТ': 0.002065700577166516, 'КОТОРЫЙ': 0.0020272773771551245, 'ОНИ': 0.0017431213791518378, 'ЖЕ': 0.0015952949638409278, 'КОТОРЫЕ': 0.001460288748368584, 'ЯВЛЯЕТСЯ': 0.0013089131305247337, 'ДО': 0.0012305754938998915, 'СЕБЯ': 0.0010322021574496925, 'МИР': 0.0009323931676427932, 'ОДНАКО,': 0.0009305194072038413, 'КОТОРАЯ': 0.0009296197399614165, 'НЕСМОТРЯНА': 0.0008591394945461882, 'НЕСМОТРЯ': 0.0008591394945461882, 'ОДНИМ': 0.0007799396752357643, 'ВРЕМЕНИ': 0.0007799396752357643, 'ОТ': 0.0007734583639001039, 'ТО': 0.0007672541927587107, 'ОНИТАКЖЕ': 0.0006538084341288003, 'УМЕТЬ': 0.0006538084341288003, '—': 0.0006078657832350618, 'ДОСТИЧЬ': 0.0006036151901394411, 'МНОЖЕСТВО': 0.0005930218558052941, 'ИИХ': 0.000593021855805294, 'ПРИВЕЛОК': 0.000593021855805294, 'СУЩЕСТВУЕТ': 0.000593021855805294, 'ПРИВЕЛО': 0.000593021855805294, 'НИХ': 0.0005926806692608649, 'МНЕ': 0.0005765741747440626, 'ПОД': 0.0005765741747440624, 'ИНЕ': 0.0005765741747440622, 'ЖИЗНЬ': 0.0005184355294351007, 'СТАЛА': 0.0005184355294351006, 'ОДНИМИЗ': 0.0005032287021607231, 'УМЕНЯ': 0.0005019324398935903, 'СЕЙЧАС': 0.0005019324398935902, 'ТОГДА': 0.0004862926265880493, 'НИ': 0.00047618768676534423, 'ТАКИМОБРАЗОМ,': 0.0004710157131271184, 'ОБРАЗОМ,': 0.0004710157131271184, 'БЫ': 0.0004421009372927876, 'НЕГО': 0.0004259944427759852, 'ВСЕЕЩЕ': 0.00041118421052631577, 'НАСЛАЖДАТЬСЯ': 0.00041118421052631577, 'ПОЧТИ': 0.0004015459519148722, 'ВРЕМЯ': 0.0003795633973708043, 'ТАКОГО': 0.000364719469941037, 'ОТОМ,КАК': 0.0003609909665369567, 'ТОМ,КАК': 0.0003609909665369567, 'ИЕЕ': 0.0003609909665369567, 'ЕСЛИ': 0.0003565920719239352, 'ПОТОМУ': 0.0003513527079255132, 'ТАМ': 0.0003513527079255132, 'МОЕЙ': 0.0003513527079255132, 'ВСЕЙ': 0.00035135270792551317, 'ДА': 0.00035135270792551317, 'ГОЛОС,': 0.00035039763220280954, 'СВОЙ': 0.0003360757944645822, 'ИХ': 0.0003320892661329289, 'ТАКЖЕ': 0.0003294967415986656, 'ЧТОБЫДОБИТЬСЯУСПЕХА': 0.00032690421706440013, 'МЫЖИВЕМВ': 0.00032690421706440013, 'АКТИВНОЕУЧАСТИЕВ': 0.00032690421706440013, 'ГДЕМОЖНОНАСЛАЖДАТЬСЯ': 0.00032690421706440013, 'МИРВИНОМ': 0.00032690421706440013, 'УВИДЕТЬМИРВ': 0.00032690421706440013, 'МОЖЕТПРИВЕСТИК': 0.00032690421706440013, 'ЭТОМОЖЕТПРИВЕСТИ': 0.00032690421706440013, 'ИСЛЕДИТЬЗА': 0.00032690421706440013, 'НООНИТАКЖЕ': 0.00032690421706440013, 'МОЖЕТБЫТЬНЕ': 0.00032690421706440013, 'СТЕМ,ЧТО': 0.00032690421706440013, 'ОДНИМИЗСАМЫХ': 0.00032690421706440013, 'ЧТОПРИВЕЛОК': 0.00032690421706440013, 'ЭТОПРИВЕЛОК': 0.00032690421706440013, 'ПОМОГАЕТНАМ': 0.00032690421706440013, 'СЛЮДЬМИ': 0.00032690421706440013, 'ДОБИТЬСЯУСПЕХА': 0.00032690421706440013, 'ЧТОБЫДОБИТЬСЯ': 0.00032690421706440013, 'ЖИВЕМВ': 0.00032690421706440013, 'МЫЖИВЕМ': 0.00032690421706440013, 'АКТИВНОЕУЧАСТИЕ': 0.00032690421706440013, 'ИЗНАИБОЛЕЕ': 0.00032690421706440013, 'МОЖНОНАСЛАЖДАТЬСЯ': 0.00032690421706440013, 'ГДЕМОЖНО': 0.00032690421706440013, 'МИРВ': 0.00032690421706440013, 'УВИДЕТЬМИР': 0.00032690421706440013, 'НЕОТЪЕМЛЕМОЙЧАСТЬЮ': 0.00032690421706440013, 'СУЩЕСТВУЕТМНОЖЕСТВО': 0.00032690421706440013, 'ПРИВЕСТИК': 0.00032690421706440013, 'МОЖЕТПРИВЕСТИ': 0.00032690421706440013, 'ЭТОМОЖЕТ': 0.00032690421706440013, 'ВЛИЯЮТНА': 0.00032690421706440013, 'ИСЛЕДИТЬ': 0.00032690421706440013, 'МОЖНОКУПИТЬ': 0.00032690421706440013, 'МОЖЕТПОТРЕБОВАТЬСЯ': 0.00032690421706440013, 'СВЯЗАННЫЕС': 0.00032690421706440013}
var HumPr;
var GPTPr;
var word;
var lang="rus";
var outlen=document.getElementById("outlen");
var tst=document.getElementById("tst");
var langim= document.getElementById("lang");
var text = document.getElementById("input");
var button = document.getElementById("button");
var output = document.getElementById("output");
var EGPT=0;
var txtt="";
var EHum=0;
button.onclick=function(){
if(lang=="rus"){
    var dataGPT=dataGPTru;
    var dataHum=dataHumru; 
    var force=forceru;  
}
if(lang=="eng"){
  var dataGPT=dataGPTru;
  var dataHum=dataHumru;
  var force=forceru;  
}
txtt=text.innerText;
txt=txtt.toUpperCase().split(' ');
for(let key in dataGPT){
  data[key]=0;
}
for(var j=0; j<=4;j++){
  for(var i=0; i<txt.length-j-1;i++){
    word="";
    for(var u=0; u<=j;u++){
      word+=txt[i+u];
    }
    if(word in dataGPT){
      data[word]+=1/txt.length;
    }
  }
}
EGPT=0;
EHum=0;
for(let key in data){
  EGPT+=Math.abs(data[key]-dataGPT[key])*force[key];
  EHum+=Math.abs(data[key]-dataHum[key])*force[key];
}
HumPr=Math.floor(EGPT/(EGPT+EHum)*100);
GPTPr=Math.floor(EHum/(EGPT+EHum)*100);
if(EGPT>EHum){if(lang=="eng"){output.innerText="This text is written by human with probability "+HumPr + "%"}else if(lang=="rus"){output.innerText="Текст написан людьми с вероятностью "+HumPr + "%"}output.parentElement.setAttribute("class", "elem hum");}
else{if(lang=="eng"){output.innerText="This text is written by ChatGPT with probability "+GPTPr + "%"}else if(lang=="rus"){output.innerText="Текст написан в ChatGPT с вероятностью "+GPTPr + "%"}output.parentElement.setAttribute("class", "elem gpt");}
}
langim.onchange=function(){
  lang=langim.value;
  if(lang=="rus"){
    output.innerText="Сначала напишите текст!";
    tst.innerText="Проверяет, написан ли текст в ChatGPT"; 
    outlen.innerText="Язык:";
    button.value="Проверить текст";
    text.setAttribute("data-text","Введите текст...")
  }
  else if(lang=="eng"){
    output.innerText="First write your text!";
    tst.innerText="Tests if your text is from ChatGPT"; 
    outlen.innerText="Language:";
    button.value="Test for chatGPT";
    text.setAttribute("data-text","Your text here...")
  }
  output.parentElement.setAttribute("class", "elem not");
}
setInterval(function(){
  if(text.innerText!=txtt){
    output.parentElement.setAttribute("class", "elem not");
  }
},100);
function sum( obj ) {
  var sum = 0;
  for( var el in obj ) {
    if( obj.hasOwnProperty( el ) ) {
      sum += parseFloat( obj[el] );
    }
  }
  return sum;
}